app/controllers/expenses_controller.rb

SELECT "expenses".* FROM "expenses"  ORDER BY "expenses"."created_at" DESC OFFSET 5
SELECT "transactions".* FROM "transactions"  ORDER BY "transactions"."created_at" DESC
---
  def index
    @expenses = Expense.order(created_at: :desc).offset(params[:offset]).includes(:transactions)

INSERT INTO "expenses" ("expense_name", "total_amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["expense_name", "Rent"], ["total_amount", "0.0"], ["created_at", "2015-05-16 12:23:39.688789"], ["updated_at", "2015-05-16 12:23:39.688789"]]
INSERT INTO "transactions" ("amount", "payee_id", "expense_id", "payer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["amount", "10.0"], ["payee_id", 1], ["expense_id", 12], ["payer_id", 1], ["created_at", "2015-05-18 09:28:35.211187"], ["updated_at", "2015-05-18 09:28:35.211187"]]
---
  def create
    @expense = Expense.new(expense_params)

    # Expense.transaction do
      if @expense.save
        @transaction = @expense.transactions.new(transaction_params)
        @transaction.payer = current_user

        if @transaction.save