app/controllers/transactions_controller.rb

SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" IN (1)
SELECT "transactions".* FROM "transactions"  ORDER BY "transactions"."created_at" DESC OFFSET 5
---
  def index
    @transactions = Transaction.order(created_at: :desc).offset(params[:offset]).includes(:expense)

INSERT INTO "transactions" ("amount", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["amount", "300.0"], ["created_at", "2015-05-18 03:36:53.291795"], ["updated_at", "2015-05-18 03:36:53.291795"]]
---
  def create
    transaction_params.each do |params|
      @transaction = Transaction.new(params)
      if @transaction.save